In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

In [9]:
#Q.1
val = [4,8,15,16,23,42]
s=pd.Series(val)
print(s)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [10]:
#Q.2
l= [1,2,3,4,5,6,7,8,9,0]
pd.Series(l)
print(pd.Series(l))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    0
dtype: int64

In [12]:
#Q.3
data= {'Name': ['Alice','Bob', 'Claire'],'Age':[25,30,27],'Gender':['Female','Male', 'Female']}
df= pd.DataFrame(data)

In [13]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [15]:
#Q.4
"""A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns"""
"""A Pandas Series is like a column in a table. It is a one-dimensional array holding data of any type."""
#example
#Series
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [16]:
#example
#Dataframe
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [17]:
#5. 
"""Some common function used to manipulate data in pandas data frame are 
df[columns]:Select specific columns from the DataFrame
df.iloc[row_index, column_index]: Access a specific element by index.
df.loc[row_label, column_label]: Access a specific element by label.
df['new_column'] = values: Add a new column with specified values.
"""

"Some common function used to manipulate data in pandas data frame are \ndf[columns]:Select specific columns from the DataFrame\ndf.iloc[row_index, column_index]: Access a specific element by index.\ndf.loc[row_label, column_label]: Access a specific element by label.\ndf['new_column'] = values: Add a new column with specified values.\n"

In [18]:
#6.
"""All are mutable in nature Series, DataFrame, Panel"""

'All are mutable in nature Series, DataFrame, Panel'

In [44]:
#7.
name_ser= pd.Series(['sunny', 'Alex', 'Bob', 'Romi'])
clas_ser =pd.Series([10,8,4,6])
home_ser= pd.Series(['Nagoan','tezpur', 'Guwahati','jorhat' ])

data ={'Name':name_ser,
      'Class': clas_ser,'Home':home_ser}
fd = pd.DataFrame(data)
#expalin
"""Created three series name_ser, clas_ser, home_ser. Combine this series into dictionary called data., where the keys are the column names and the values are the corresponding Series.Finally, passed the data dictionary to the pd.DataFrame() constructor to create the DataFrame fd, which now contains all the data from the individual Series, organized into columns. Each row in the DataFrame corresponds to the elements at the same index in the Series.
"""

In [45]:
fd

    Name  Class      Home
0  sunny     10    Nagoan
1   Alex      8    tezpur
2    Bob      4  Guwahati
3   Romi      6    jorhat